import enchant
import sys

def replace_letters(para):
  # characters to be replaced
  char_to_replace = {
      'අ~?~' : 'අං' ,
      '|ක' : 'ක්' , 'කආ' : 'කා' , 'කඇ' : 'කැ' , 'කඈ' : 'කෑ' , 'කඉ' : 'කි' , 'කඊ' : 'කී' , 'කඋ' : 'කු' , 'කඌ' : 'කූ' , 'කඑ' : 'කෙ' , 'කඒ' : 'කේ' , 'කඓ' : 'කෛ' , 'කඔ' : 'කො' , 'කඕ' : 'කෝ' , 'කඖ' : 'කෞ' , 'කඅං' : 'කං', 'ක්ර':'ක්‍ර', 'ක්ය':'ක්‍ය',
      '|ඛ' : 'ඛ්' , 'ඛආ': 'ඛා' , 'ඛඇ' : 'ඛැ' , 'ඛඈ' : 'ඛෑ' , 'ඛඉ' : 'ඛි' , 'ඛඊ' : 'ඛී' , 'ඛඋ' : 'ඛු' , 'ඛඌ' : 'ඛූ' , 'ඛඑ' : 'ඛෙ' , 'ඛඒ' : 'ඛේ' , 'ඛඓ' : 'ඛෛ' , 'ඛඔ' : 'ඛො' , 'ඛඕ' : 'ඛෝ' , 'ඛඖ' : 'ඛෞ' , 'ඛඅං' : 'ඛං', 'ඛ්ර':'ඛ්‍ර', 'ඛ්ය':'ඛ්‍ය',
      '|ග' : 'ග්' , 'ගආ': 'ගා' , 'ගඇ' : 'ගැ' , 'ගඈ' : 'ගෑ' , 'ගඉ' : 'ගි' , 'ගඊ' : 'ගී' , 'ගඋ' : 'ගු' , 'ගඌ' : 'ගූ' , 'ගඑ' : 'ගෙ' , 'ගඒ' : 'ගේ' , 'ගඓ' : 'ගෛ' , 'ගඔ' : 'ගො' , 'ගඕ' : 'ගෝ' , 'ගඖ' : 'ගෞ' , 'ගඅං' : 'ගං' , 'nmග' : 'ඟ','ග්ර':'ග්‍ර','ග්ය':'ග්‍ය',
      '|ඝ' : 'ඝ්' , 'ඝආ': 'ඝා' , 'ඝඇ' : 'ඝැ' , 'ඝඈ' : 'ඝෑ' , 'ඝඉ' : 'ඝි' , 'ඝඊ' : 'ඝී' , 'ඝඋ' : 'ඝු' , 'ඝඌ' : 'ඝූ' , 'ඝඑ' : 'ඝෙ' , 'ඝඒ' : 'ඝේ' , 'ඝඓ' : 'ඝෛ' , 'ඝඔ' : 'ඝො' , 'ඝඕ' : 'ඝෝ' , 'ඝඖ' : 'ඝෞ' , 'ඝඅං' : 'ඝං','ඝ්ර':'ඝ්‍ර', 'ඝ්ය':'ඝ්‍ය',
      '|ඟ' : 'ඟ්' , 'ඟආ': 'ඟා' , 'ඟඇ' : 'ඟැ' , 'ඟඈ' : 'ඟෑ' , 'ඟඉ' : 'ඟි' , 'ඟඊ' : 'ඟී' , 'ඟඋ' : 'ඟු' , 'ඟඌ' : 'ඟූ' , 'ඟඑ' : 'ඟෙ' , 'ඟඒ' : 'ඟේ' , 'ඟඔ' : 'ඟො' , 'ඟඕ' : 'ඟෝ' ,'ඟ්ර':'ඟ්‍ර', 'ඟ්ය':'ඟ්‍ය',
      '|ච' : 'ච්' , 'චආ': 'චා' , 'චඇ' : 'චැ' , 'චඈ' : 'චෑ' , 'චඉ' : 'චි' , 'චඊ' : 'චී' , 'චඋ' : 'චු' , 'චඌ' : 'චූ' , 'චඑ' : 'චෙ' , 'චඒ' : 'චේ' , 'චඓ' : 'චෛ' , 'චඔ' : 'චො' , 'චඕ' : 'චෝ' , 'චඖ' : 'චෞ' , 'චඅං' : 'චං','ච්ර':'ච්‍ර', 'ච්ය':'ච්‍ය',
      '|ඡ' : 'ඡ්' , 'ඡආ': 'ඡා' , 'ඡඇ' : 'ඡැ' , 'ඡඈ' : 'ඡෑ' , 'ඡඉ' : 'ඡි' , 'ඡඊ' : 'ඡී' , 'ඡඋ' : 'ඡු' , 'ඡඌ' : 'ඡූ' , 'ඡඑ' : 'ඡෙ' , 'ඡඒ' : 'ඡේ' , 'ඡඓ' : 'ඡෛ' , 'ඡඔ' : 'ඡො' , 'ඡඕ' : 'ඡෝ' , 'ඡඖ' : 'ඡෞ' , 'ඡඅං' : 'ඡං','ඡ්ර':'ඡ්‍ර', 'ඡ්ය':'ඡ්‍ය',
      '|ජ' : 'ජ්' , 'ජආ': 'ජා' , 'ජඇ' : 'ජැ' , 'ජඈ' : 'ජෑ' , 'ජඉ' : 'ජි' , 'ජඊ' : 'ජී' , 'ජඋ' : 'ජු' , 'ජඌ' : 'ජූ' , 'ජඑ' : 'ජෙ' , 'ජඒ' : 'ජේ' , 'ජඓ' : 'ජෛ' , 'ජඔ' : 'ජො' , 'ජඕ' : 'ජෝ' , 'ජඖ' : 'ජෞ' , 'ජඅං' : 'ජං','ජ්ර':'ජ්‍ර', 'ජ්ය':'ජ්‍ය',
      '|ඤ' : 'ඤ් ' , 'ඤආ': 'ඤා' , 'ඤඇ' : 'ඤැ' , 'ඤඈ' : 'ඤෑ' , 'ඤඉ' : 'ඤි' , 'ඤඊ' : 'ඤී' , 'ඤඋ' : 'ඤු' , 'ඤඌ' : 'ඤූ' , 'ඤඑ' : 'ඤෙ' , 'ඤඒ' : 'ඤේ' , 'ඤඓ' : 'ඤෛ' , 'ඤඔ' : 'ඤො' , 'ඤඕ' : 'ඤෝ' , 'ඤඖ' : 'ඤෞ' , 'ඤඅං' : 'ඤං','ඤ්ර':'ඤ්‍ර', 'ඤ්ය':'ඤ්‍ය',

      '|ට':'ට්','ටආ': 'ටා','ටඇ': 'ටැ','ටඈ': 'ටෑ','ටඉ': 'ටි','ටඊ': 'ටී','ටඋ': 'ටු','ටඌ': 'ටූ','ටඑ': 'ටෙ','ටඒ': 'ටේ','ටඔ': 'ටො','ටඕ': 'ටෝ','ටඖ': 'ටෞ','ටඓ': 'ටෛ','ට්ර':'ට්‍ර', 'ට්ය':'ට්‍ය',
      '|ඨ':'ඨ්','ඨආ': 'ඨා','ඨඇ': 'ඨැ','ඨඈ': 'ඨෑ','ඨඋ': 'ඨු','ඨඌ': 'ඨූ','ඨඉ': 'ඨි','ඨඊ': 'ඨී','ඨඑ': 'ඨෙ','ඨඒ': 'ඨේ','ඨඓ': 'ඨෛ','ඨඔ': 'ඨො','ඨඕ': 'ඨෝ','ඨඖ': 'ඨෞ','ඨ්ර':'ඨ්‍ර', 'ඨ්ය':'ඨ්‍ය',
      '|ඩ':'ඩ්','ඩආ': 'ඩා','ඩඇ': 'ඩැ','ඩඈ': 'ඩෑ','ඩඉ': 'ඩි','ඩඊ': 'ඩී','ඩඋ': 'ඩු','ඩඌ': 'ඩූ','ඩඑ': 'ඩෙ','ඩඒ': 'ඩේ','ඩඓ': 'ඩෛ','ඩඔ': 'ඩො','ඩඕ': 'ඩෝ','ඩඖ': 'ඩෞ','ඩ්ර':'ඩ්‍ර', 'ඩ්ය':'ඩ්‍ය',
      '|ඪ':'ඪ්','ඪආ': 'ඪා','ඪඇ': 'ඪැ','ඪ ඈ': 'ඪෑ',
      '|ණ':'ණ්','ණආ': 'ණා','ණඇ': 'ණැ','ණඈ': 'ණෑ','ණඉ': 'ණි','ණඊ': 'ණී','ණඋ': 'ණු','ණ ඌ': 'ණූ','ණඑ': 'ණෙ','ණඒ': 'ණේ','ණඔ': 'ණො','ණඕ': 'ණෝ','ණඖ': 'ණෞ','ණඓ': 'ණෛ','ණ්ර':'ණ්‍ර', 'ණ්ය':'ණ්‍ය',
      '|ත':'ත්','තආ': 'තා','තඇ': 'තැ','තඈ': 'තෑ','තඉ': 'ති','තඊ': 'තී','තඋ': 'තු','තඌ': 'තූ','තඑ': 'තෙ','තඒ': 'තේ','තඔ': 'තො','තඕ': 'තෝ','තඖ': 'තෞ','තඓ': 'තෛ','ත්ර':'ත්‍ර', 'ත්ය':'ත්‍ය',
      '|ථ':'ථ්','ථආ': 'ථා','ථඇ': 'ථැ','ථඈ': 'ථෑ','ථඉ': 'ථි','ථඊ': 'ථී','ථඋ': 'ථු','ථඌ': 'ථූ','ථඑ': 'ථෙ','ථඒ': 'ථේ','ථඔ': 'ථො','ථඕ': 'ථෝ','ථඖ': 'ථෞ','ථඓ': 'ථෛ','ථ්ර':'ථ්‍ර', 'ථ්ය':'ථ්‍ය',
      '|ද':'ද්','දආ': 'දා','දඇ': 'දැ','දඈ': 'දෑ','දඉ': 'දි','දඊ': 'දී','දඋ': 'දු','දඌ': 'දූ','දඑ': 'දෙ','දඒ': 'දේ','දඔ': 'දො','දඕ': 'දෝ','දඖ': 'දෞ','දඓ': 'දෛ','ද්ර':'ද්‍ර', 'ද්ය':'ද්‍ය','nmද':'ඳ',
      '|ධ':'ධ්','ධආ': 'ධා','ධඇ': 'ධැ','ධඈ': 'ධෑ','ධඉ': 'ධි','ධඊ': 'ධී','ධඋ': 'ධු','ධඌ': 'ධූ','ධඑ': 'ධෙ','ධඒ': 'ධේ','ධඔ': 'ධො','ධඕ': 'ධෝ','ධඖ': 'ධෞ','ධඓ': 'ධෛ','ධ්ර':'ධ්‍ර', 'ධ්ය':'ධ්‍ය',
      '|න':'න්','නආ': 'නා','නඇ': 'නැ','නඈ': 'නෑ','නඉ': 'නි','නඊ': 'නී','නඋ': 'නු','නඌ': 'නූ','නඑ': 'නෙ','නඒ': 'නේ','නඔ': 'නො','නඕ': 'නෝ','නඖ': 'නෞ','නඓ': 'නෛ','න්ර':'න්‍ර', 'න්ය':'න්‍ය',
      'ඳආ':'ඳා','ඳඇ':'ඳැ','ඳඈ':'ඳෑ','ඳඉ':'ඳි','ඳඊ':'ඳී','ඳඋ':'ඳු','ඳඌ':'ඳූ','ඳඑ':'ඳෙ','ඳඒ':'ඳේ','ඳඔ':'ඳො','ඳඕ':'ඳෝ',
      'ඹආ':'ඹා','ඹඇ':'ඹැ','ඹඈ':'ඹෑ','ඹඉ':'ඹි','ඹඊ':'ඹී','ඹඋ':'ඹු','ඹඌ':'ඹූ','ඹඑ':'ඹෙ','ඹඒ':'ඹේ','ඹඔ':'ඹො','ඹඕ':'ඹෝ',

      '|ප':'ප්','පආ':'පා','පඇ':'පැ','පඈ':'පෑ','පඉ':'පි','පඊ':'පී','පඋ':'පු','පඌ':'පූ','පඑ':'පෙ','පඒ':'පේ','පඓ':'පෛ','පඔ':'පො','පඕ':'පෝ','පඖ':'පෞ','ප්ර':'ප්‍ර', 'ප්ය':'‍ප්‍ය',
      '|ඵ':'ඵ්','ඵආ': 'ඵා','ඵඇ': 'ඵැ','ඵඈ': 'ඵෑ','ඵඉ': 'ඵි','ඵඊ': 'ඵී','ඵඋ': 'ඵු','ඵඌ': 'ඵූ','ඵඑ': 'ඵෙ','ඵඒ': 'ඵේ','ඵඔ': 'ඵො','ඵඕ': 'ඵෝ','ඵඖ': 'ඵෞ','ඵඓ': 'ඵෛ','ඵ්ර':'ඵ්‍ර', 'ඵ්ය':'ඵ්‍ය',
      '|බ':'බ්','බආ': 'බා','බඇ': 'බැ','බඈ': 'බෑ','බඉ': 'බි','බඊ': 'බී','බඋ': 'බු','බඌ': 'බූ','බඑ': 'බෙ','බඒ': 'බේ','බඔ': 'බො','බඕ': 'බෝ','බඖ': 'බෞ','බඓ': 'බෛ','බ්ර':'බ්‍ර', 'බ්ය':'බ්‍ය','nmබ':'ඹ',
      '|භ':'භ්','භආ': 'භා','භඇ': 'භැ','භඈ': 'භෑ','භඉ': 'භි','භඊ': 'භී','භඋ': 'භු','භඌ': 'භූ','භඑ': 'භෙ','භඒ': 'භේ','භඔ': 'භො','භඕ': 'භෝ','භඖ': 'භෞ','භඓ': 'භෛ','භ්ර':'භ්‍ර', 'භ්ය':'භ්‍ය', 
      '|ම':'ම්','මආ': 'මා','මඇ': 'මැ','මඈ': 'මෑ','මඉ': 'මි','මඊ': 'මී','මඋ': 'මු','මඌ': 'මූ','මඑ': 'මෙ','මඒ': 'මේ','මඔ': 'මො','මඕ': 'මෝ','මඖ': 'මෞ','මඓ': 'මෛ','ම්ර':'ම්‍ර', 'ම්ය':'ම්‍ය',
      '|ය':'ය්','යආ':'යා','යඇ':'යැ','යඈ':'යෑ','යඉ':'යි','යඊ':'යී','යඋ':'යු','යඌ':'යූ','යඑ':'යෙ','යඒ':'යේ','යඓ':'යෛ','යඔ':'යො','යඕ':'යෝ','යඖ':'යෞ','ය්ර':'ය්‍ර', 'ය්ය':'ය්‍ය',
      '|ර':'ර්','රආ':'රා','රඇ':'රැ','රඈ':'රෑ','රඉ':'රි','රඊ':'රී','රඋ':'රු','රඌ':'රූ','රඑ':'රෙ','රඒ':'රේ','රඓ':'රෛ','රඔ':'රො','රඕ':'රෝ','රඖ':'රෞ',
      '|ල':'ල්','ලආ': 'ලා','ලඇ': 'ලැ','ලඈ': 'ලෑ','ලඉ': 'ලි','ලඊ': 'ලී','ලඋ': 'ලු','ලඌ': 'ලූ','ලඑ': 'ලෙ','ලඒ': 'ලේ','ලඔ': 'ලො','ලඕ': 'ලෝ','ලඖ': 'ලෞ','ලඓ': 'ලෛ','ල්ය':'ල්‍ය', 
      '|ව' : 'ව් ' , 'වආ': 'වා' , 'වඇ' : 'වැ' , 'වඈ' : 'වෑ' , 'වඉ' : 'වි' , 'වඊ' : 'වී' , 'වඋ' : 'වු' , 'වඌ' : 'වූ' , 'වඑ' : 'වෙ' , 'වඒ' : 'වේ' , 'වඓ' : 'වෛ' , 'වඔ' : 'වො' , 'වඕ' : 'වෝ' , 'වඖ' : 'වෞ' , 'වඅං' : 'වං','ව්ර':'ව්‍ර', 'ව්ය':'ව්‍ය',
      
      '|ශ':'ශ්','ශආ':'ශා','ශඇ':'ශැ','ශඈ':'ශෑ','ශඉ':'ශි','ශඊ':'ශී','ශඋ':'ශු','ශඌ':'ශූ','ශඑ':'ශෙ','ශඒ':'ශේ','ශඔ':'ශො','ශඕ':'ශෝ','ශ්ර':'ශ්‍ර', 'ශ්ය':'ශ්‍ය',
      '|ෂ':'ෂ්','ෂආ':'ෂා','ෂඇ':'ෂැ','ෂඈ':'ෂෑ','ෂඉ':'ෂි','ෂඊ':'ෂී','ෂඋ':'ෂු','ෂඌ':'ෂූ','ෂඑ':'ෂෙ','ෂඒ':'ෂේ','ෂඔ':'ෂො','ෂඕ':'ෂෝ','ෂ්ර':'ෂ්‍ර', 'ෂ්ය':'ෂ්‍ය',
      '|ස':'ස්','සආ':'සා','සඇ':'සැ','සඈ':'සෑ','සඉ':'සි','සඊ':'සී','සඋ':'සු','සඌ':'සූ','සඑ':'සෙ','සඒ':'සේ','සඔ':'සො','සඕ':'සෝ','සඖ':'සෞ','ස්ර':'ස්‍ර', 'ස්ය':'ස්‍ය',

      '|හ':'හ්','හආ':'හා','හඇ':'හැ','හඈ':'හෑ','හඉ':'හි','හඊ':'හී','හඋ':'හු','හඌ':'හූ','හඑ':'හෙ','හඒ':'හේ','හඓ':'හෛ','හඔ':'හො','හඕ':'හෝ','හඖ':'හෞ','හ්ර':'හ්‍ර', 'හ්ය':'හ්‍ය',
      '|ළ':'ළ්','ළආ':'ළා','ළඇ':'ළැ','ළඈ':'ළෑ','ළඉ':'ළි','ළඊ':'ළී','ළඋ':'ළු','ළඌ':'ළුු','ළඑ':'ළෙ','ළඒ':'ළේ','ළඓ':'ළෛ','ළඔ':'ළො','ළඕ':'ළෝ','ළඖ':'ළෞ',
      '|ෆ':'ෆ්','ෆආ':'ෆා','ෆඇ':'ෆැ','ෆඈ':'ෆෑ','ෆඉ':'ෆි','ෆඊ':'ෆී','ෆඋ':'ෆු','ෆඌ':'ෆූ','ෆඑ':'ෆෙ','ෆඒ':'ෆේ','ෆඓ':'ෆෛ','ෆඔ':'ෆො','ෆඕ':'ෆෝ','ෆඖ':'ෆෞ','ෆ්ර':'ෆ්‍ර', 'ෆ්ය':'ෆ්‍ය',
      'සි~?~' : 'සිං' ,


    }

  for key, value in char_to_replace.items():
    para = para.replace(key, value) # Replace key character with value character in string
  
  return para


contents = ""
with open('BrailleReader/web_app/static/data/results/image_sample.marked.txt', encoding='utf-8') as f:
    contents = f.read()
    print(contents)

replace_letters(contents)

# contents = ""
text_file = open("BrailleReader/web_app/final_results/corrected.txt", "w", encoding='utf-8')
# text_file = open("test.txt", "w")
n = text_file.write(replace_letters(contents))
text_file.close()

